InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыПередачиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ) Реализация со склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>umk_ПроверилБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>umk_ВедомостьСоставил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗаполнениеДокументовСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа,
//  ТекПользователь                - ссылка на справочник, определяет текущего пользователя  
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  ТипОперации                    - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                   если не передан, то реквизиты, зависящие от вида операции, не заполняются
//  ПараметрОбъектКопирования               - ссылка на объект копирования,
//  ПараметрОснование                       - ссылка на объект-основание.
//  СтруктураПараметровДляПолученияДоговора - Структура содержит список допустимых видов договоров.
//
Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "", ПараметрОбъектКопирования = Неопределено, ПараметрОснование = неопределено, СтруктураПараметровДляПолученияДоговора = Неопределено) Экспорт

	Перем ТипЦен;
	Перем ОрганизацияПлательщикНДС;

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
		ДокументОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;
	
	
	// Заполним флаги принадлежности к учету исходя из значений по умолчанию.
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", МетаданныеДокумента) Тогда

		ДокументОбъект.ОтражатьВУправленческомУчете = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "НеОтражатьДокументыВУправленческомУчете");

	КонецЕсли;

	//Флаги БУ и НУ взаимосвязаны, не возможна ситуация, когда флаг НУ "истина". а флаг БУ "ложь".
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете", МетаданныеДокумента) Тогда

		ФлагОтражатьВБухгалтерскомУчете = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "НеОтражатьДокументыВБухгалтерскомУчете");

		ДокументОбъект.ОтражатьВБухгалтерскомУчете  = ФлагОтражатьВБухгалтерскомУчете;

	КонецЕсли;
	
	ОрганизацияПлательщикНДС = Истина; // для заполнения реквизита УчитыватьНДС
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("КассаККМ", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.КассаККМ) Тогда
			ДокументОбъект.КассаККМ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКассаККМ");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
			ДокументОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
			// + umk
			ОрганизацияОтбор = umk_ПолныеПрава.ЗначениеОрганизацииДляОтбора();
			Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
				ДокументОбъект.Организация = ОрганизацияОтбор;
			КонецЕсли; 
			// - umk
		КонецЕсли;	
		
		Если ОбщегоНазначения.ПолучитьСхемуНалогообложения(ОбщегоНазначения.ПолучитьРабочуюДату(),ДокументОбъект.Организация).НДС = Ложь Тогда
			ОрганизацияПлательщикНДС = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	//если копируем - возврат из процедуры
	Если ПараметрОбъектКопирования<>неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение)) Тогда
		ДокументОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделение");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента)
	   И ( НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)) Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорЭквайринга", МетаданныеДокумента) Тогда
		ДокументОбъект.ДоговорЭквайринга = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойДоговорЭквайринга");

	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.СтруктурнаяЕдиница) 
	   И ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
		ДокументОбъект.СтруктурнаяЕдиница = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Склад)) Тогда
		ДокументОбъект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СкладГруппа", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.СкладГруппа)) Тогда
		ДокументОбъект.СкладГруппа = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СкладОрдер", МетаданныеДокумента) 
	   И ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПоступления", МетаданныеДокумента)
	И НЕ ЗначениеЗаполнено(ДокументОбъект.СкладОрдер) И НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПоступления) Тогда
		ДокументОбъект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
		ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("СтавкаНДС", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.СтавкаНДС)) Тогда
		ДокументОбъект.СтавкаНДС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяСтавкаНДС");
	КонецЕсли;
    	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
	   И ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
	   
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента) Тогда
		    Если НЕ ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
				ДокументОбъект.СчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
			КонецЕсли;
			Если ДокументОбъект.СчетОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.СчетОрганизации = Неопределено;
			КонецЕсли;
		КонецЕсли;
	   
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("БанковскийСчетОрганизации", МетаданныеДокумента) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетОрганизации) Тогда
				ДокументОбъект.БанковскийСчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
			КонецЕсли;	
			Если ДокументОбъект.БанковскийСчетОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.БанковскийСчетОрганизации = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПодразделениеОрганизации", МетаданныеДокумента) Тогда
		    Если НЕ ЗначениеЗаполнено(ДокументОбъект.ПодразделениеОрганизации) Тогда
				ДокументОбъект.ПодразделениеОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделениеОрганизации");
			КонецЕсли;
			Если ДокументОбъект.ПодразделениеОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.ПодразделениеОрганизации = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОбособленноеПодразделениеОрганизации", МетаданныеДокумента) Тогда
		    Если НЕ ЗначениеЗаполнено(ДокументОбъект.ОбособленноеПодразделениеОрганизации) Тогда
				ДокументОбъект.ОбособленноеПодразделениеОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеОбособленноеПодразделениеОрганизации");
			КонецЕсли;
			Если ДокументОбъект.ОбособленноеПодразделениеОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.ОбособленноеПодразделениеОрганизации = Неопределено;
			КонецЕсли;
			ДокументОбъект.ПоОбособленномуПодразделению = НЕ ДокументОбъект.ОбособленноеПодразделениеОрганизации.Пустая();
		КонецЕсли;

	КонецЕсли;	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("БанковскийСчет", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчет)
	   И (ЗначениеЗаполнено(ДокументОбъект.Организация.ЮрФизЛицо)) Тогда
		ДокументОбъект.БанковскийСчет = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Касса", МетаданныеДокумента)Тогда
		Если  Не ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			ДокументОбъект.Касса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКасса");
		КонецЕсли;
		
		//Возможно заполненная касса не соответствует заполненной организации
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ДокументОбъект.Касса.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.Касса = Неопределено;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("КассаККМ", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.КассаККМ) Тогда
			ДокументОбъект.КассаККМ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКассаККМ");
		КонецЕсли;

		//Возможно заполненная касса ККМ не соответствует заполненной организации
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ЗначениеЗаполнено(ДокументОбъект.КассаККМ)
			   И ДокументОбъект.КассаККМ.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.КассаККМ = Неопределено;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ИспользоватьПлановуюСебестоимость", МетаданныеДокумента) 
		И НЕ ДокументОбъект.ИспользоватьПлановуюСебестоимость Тогда
		ДокументОбъект.ИспользоватьПлановуюСебестоимость = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ИспользоватьПлановуюСебестоимость");
	КонецЕсли;
	
	ДатаДокумента = ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Дата),ОбщегоНазначения.ПолучитьРабочуюДату(),ДокументОбъект.Дата);

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента) Тогда

		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если ТипОперации = "Покупка" Тогда
				ДокументОбъект.Контрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойПоставщик");
			ИначеЕсли ТипОперации = "Продажа" Тогда
				ДокументОбъект.Контрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойПокупатель");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитДокумента("КонтактноеЛицо", МетаданныеДокумента) Тогда
			Если (НЕ ЗначениеЗаполнено(ДокументОбъект.КонтактноеЛицо))
			   И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты")
			   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				ДокументОбъект.КонтактноеЛицо = ДокументОбъект.Контрагент.ОсновноеКонтактноеЛицо;
			Иначе
				ДокументОбъект.КонтактноеЛицо = Справочники.КонтактныеЛица.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", МетаданныеДокумента) Тогда

			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) 
			   И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
			   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда

				Если ТипЗнч(СтруктураПараметровДляПолученияДоговора) <> Тип("Структура") Тогда
					Если ТипОперации = "Продажа" Тогда 
						СтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
					ИначеЕсли ТипОперации = "Покупка" Тогда 
						СтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();
					Иначе
						СтруктураПараметровДляПолученияДоговора = Неопределено;
					КонецЕсли;
				КонецЕсли;

				Организация = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента), 
				                                               ДокументОбъект.Организация, Неопределено);
				ДокументОбъект.ДоговорКонтрагента = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Организация, ДокументОбъект.Контрагент, СтруктураПараметровДляПолученияДоговора);
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента)
			   И (ДокументОбъект.ДоговорКонтрагента.Владелец <> ДокументОбъект.Контрагент 
			 Или (ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
			     И ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ДокументОбъект.ДоговорКонтрагента.Организация <> ДокументОбъект.Организация)) Тогда

				//если договор не соответствует контрагенту или организации - очистить договор
				ДокументОбъект.ДоговорКонтрагента = Неопределено; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда

				//тип сделки имеет смысл устанавливать только в том случае, если заполнен договор
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("Сделка", МетаданныеДокумента) Тогда
					ЗаказПокупателя = Истина;
					Если ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ
						ДокументОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
						ЗаказПокупателя = Ложь;
					КонецЕсли;
					ЗаполнениеДокументов.УстановитьТипСделки(ДокументОбъект, ЗаказПокупателя);
				КонецЕсли;
				
				//если в документе есть реквизит организация и он не заполнен
				// то заполняем из договора
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)

					И НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда

					ДокументОбъект.Организация = ДокументОбъект.ДоговорКонтрагента.Организация;
					
				КонецЕсли;
				
				ЕстьРеквизитКурсВзаиморасчетов      = ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента);
				ЕстьРеквизитКратностьВзаиморасчетов = ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента);

				Если ЕстьРеквизитКурсВзаиморасчетов 
				 Или ЕстьРеквизитКратностьВзаиморасчетов Тогда
					СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДатаДокумента);
				КонецЕсли;

				Если ЕстьРеквизитКурсВзаиморасчетов Тогда
					ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;
				КонецЕсли;

				Если ЕстьРеквизитКратностьВзаиморасчетов Тогда
					ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента)
				   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ТипЦен)) Тогда
					ДокументОбъект.ТипЦен = ДокументОбъект.ДоговорКонтрагента.ТипЦен;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли; // есть реквизит договор

		Если ОбщегоНазначения.ЕстьРеквизитДокумента("БанковскийСчетКонтрагента", МетаданныеДокумента) 
		   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетКонтрагента) Тогда
				ДокументОбъект.БанковскийСчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
			ИначеЕсли ДокументОбъект.БанковскийСчетКонтрагента.Владелец <> ДокументОбъект.Контрагент Тогда
				ДокументОбъект.БанковскийСчетКонтрагента = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;// есть реквизит контрагент

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("Касса", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.Касса.ВалютаДенежныхСредств;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента)
		        И ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", МетаданныеДокумента)
		        И ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Иначе
			ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента)) Тогда
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДатаДокумента);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

		Если ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсВзаиморасчетов)) Тогда
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, ДатаДокумента);
		ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;

		Если ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;

	// Если тип цен оказался не заполненным, то берем его из установок пользователя
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ТипЦен)) Тогда
		Если ТипОперации = "Продажа" Тогда
			ДокументОбъект.ТипЦен = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойТипЦенПродажи");
		КонецЕсли;
	КонецЕсли;

	флСуммаВключаетНДС = Истина;

	Если (ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента))
	   И (ЗначениеЗаполнено(ДокументОбъект.ТипЦен)) Тогда

		// Если тип цен оказался не заполненным, то берем его из установок пользователя
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ТипЦен) И ТипОперации = "Продажа" Тогда
			ДокументОбъект.ТипЦен = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойТипЦенПродажи");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ТипЦен) Тогда

			// Если ТипЦен - элемент справочника ТипыЦенНоменклатуры и цены выбранного типа расчетные, 
			// то флаги включения налогов надо брать из базовой цены
			Если ТипЗнч(ДокументОбъект.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") И ДокументОбъект.ТипЦен.Рассчитывается Тогда
				флСуммаВключаетНДС = ДокументОбъект.ТипЦен.БазовыйТипЦен.ЦенаВключаетНДС;
			Иначе
				флСуммаВключаетНДС = ДокументОбъект.ТипЦен.ЦенаВключаетНДС;
			КонецЕсли;
		КонецЕсли;

		// Флаги учета налогов заполняем, только если флаг УчитыватьНДС не заполнен.
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента) 
		   И (Не ДокументОбъект.УчитыватьНДС) 
		   И ОрганизацияПлательщикНДС Тогда

			ДокументОбъект.УчитыватьНДС     = Истина;
			ДокументОбъект.СуммаВключаетНДС = флСуммаВключаетНДС;

		КонецЕсли;
		
	Иначе

		// Заполним значениями по умолчанию (нет, либо не заполнен ТипЦен).
		// Флаги учета налогов заполняем, только если флаг УчитыватьНДС не заполнен.
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента) 
		   И (Не ДокументОбъект.УчитыватьНДС)
		   И ОрганизацияПлательщикНДС Тогда

			ДокументОбъект.УчитыватьНДС     = Истина;
			ДокументОбъект.СуммаВключаетНДС = НЕ УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "СуммаНеВключаетНДС");
		КонецЕсли;
	КонецЕсли;

	Если  ОбщегоНазначения.ЕстьРеквизитДокумента("АвторасчетНДС", МетаданныеДокумента)
		И ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
		И ДокументОбъект.УчитыватьНДС Тогда
		
		ДокументОбъект.АвторасчетНДС = Истина;
		
	 КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ЗанимаемыхСтавок", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ЗанимаемыхСтавок)) Тогда
		ДокументОбъект.ЗанимаемыхСтавок = 1;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаС", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаС)) Тогда
		ДокументОбъект.ДатаС = ДокументОбъект.Дата;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПериодРегистрации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации)) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПоступления", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПоступления)) Тогда
		ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПередачи", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПередачи)) Тогда
		ДокументОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("УсловиеПродаж", МетаданныеДокумента)
	   И Не ЗначениеЗаполнено(ДокументОбъект.УсловиеПродаж) Тогда
		ДокументОбъект.УсловиеПродаж = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеУсловиеПродаж");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПредставительОрганизации", МетаданныеДокумента) Тогда
		Данные = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",ДокументОбъект.Организация,Перечисления.ОтветственныеЛицаОрганизаций.ВыпискаДокументов);
		
		ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецДня(ТекущаяДата()), Данные);
		
		Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ВыпискаДокументов);
		
		Если Результат <> Неопределено Тогда
			ДокументОбъект.ПредставительОрганизации = Результат.ФизическоеЛицо;
		Иначе
			ДокументОбъект.ПредставительОрганизации = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитДокумента("МестоСоставленияДокумента", МетаданныеДокумента) Тогда
	  ДокументОбъект.МестоСоставленияДокумента = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь,"ОсновноеМестоСоставленияРасходныхДокументов");
  	КонецЕсли

	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

Процедура ЗаполнитьОтветственоеЛицо(ДокументОбъект) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	// + umk
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПредставительОрганизации", МетаданныеДокумента) Тогда
		Данные = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",ДокументОбъект.Организация,Перечисления.ОтветственныеЛицаОрганизаций.ВыпискаДокументов);
		
		ОтвЛица = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(КонецДня(ДокументОбъект.Дата), Данные);
		
		Результат = ОтвЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ВыпискаДокументов);
		
		Если Результат <> Неопределено Тогда
			ДокументОбъект.ПредставительОрганизации = Результат.ФизическоеЛицо;
		Иначе
			ДокументОбъект.ПредставительОрганизации = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
